app/views/posts/index.html.erb

    <div class= "span8 well">
      <% post.categories.each do |category| %>
---
SELECT "categories".* FROM "categories" INNER JOIN "postcategories" ON "categories"."id" = "postcategories"."category_id" WHERE "postcategories"."post_id" = ?  [["post_id", 1]]

      <small> <p>
      <%= link_to "#{post.comments.size} comments", post_path(post) %>
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 1]]