app/views/posts/show.html.erb

SELECT "categories".* FROM "categories" INNER JOIN "postcategories" ON "categories"."id" = "postcategories"."category_id" WHERE "postcategories"."post_id" = ?  [["post_id", 1]]
---
<p>
  <% @post.categories.each do |category| %>